# pandas DataFrame

## Setup

In [1]:
import numpy as np
import pandas as pd

pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)

### Create Simple DataFrame

In [2]:
mda = np.array([
        [1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]
    ])
df1 = pd.DataFrame(mda)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [3]:
df1.columns = ['A', 'B', 'C']
df1.index = np.arange(1, len(df1) + 1)
df1

   A  B  C
1  1  2  3
2  4  5  6
3  7  8  9

In [4]:
df2 = pd.DataFrame(mda, columns=['A', 'B', 'C'], index=np.arange(1, len(mda) + 1))
df2

   A  B  C
1  1  2  3
2  4  5  6
3  7  8  9

### Create DataFrame using Series as Rows

In [5]:
people = pd.Series(['Adam', 'Bob', 'Carl', 'Dave'], index=['A', 'B', 'C', 'D'])
places = pd.Series(['Africa', 'Berlin', 'Canada'], index=['A', 'B', 'C'])
things = pd.Series(['Apple', 'Baseball bat', 'Car'], index=['A', 'B', 'C'])

df3 = pd.DataFrame([people, places, things])
df3

        A             B       C     D
0    Adam           Bob    Carl  Dave
1  Africa        Berlin  Canada   NaN
2   Apple  Baseball bat     Car   NaN

In [6]:
df3.index = ['People', 'Place', 'Thing']
df3

             A             B       C     D
People    Adam           Bob    Carl  Dave
Place   Africa        Berlin  Canada   NaN
Thing    Apple  Baseball bat     Car   NaN

In [7]:
df4 = pd.DataFrame(
    [people, places, things],
    index = ['People', 'Place', 'Thing'],
    columns = ['A', 'B', 'D']
)
df4

             A             B     D
People    Adam           Bob  Dave
Place   Africa        Berlin   NaN
Thing    Apple  Baseball bat   NaN

### Create Series

In [8]:
# Create NumPy arrays with random grades.
rng = np.random.default_rng(seed=42)
ar1 = rng.choice(['A', 'B', 'C', 'D', 'F'], 100, p=[.2, .4, .3, .08, .02])
ar2 = rng.choice(['A', 'B', 'C', 'D', 'F'], 50,  p=[.3, .4, .2, .1, 0])
ar3 = rng.choice(['a', 'b', 'c', 'd', 'f'], 200,  p=[.15, .45, .25, .13, .02])

# Create pandas Series from arrays.
s1 = pd.Series(ar1)
s2 = pd.Series(ar2)
s3 = pd.Series(ar3)

### Create DataFrame from Dictionary

In [9]:
d = {
    'grades1': s1,
    'grades2': s2,
    'grades3': s3
}

df1_grades = pd.DataFrame(d)
df1_grades

    grades1 grades2 grades3
0         C       D       c
1         B       B       d
2         C       A       a
3         C       D       b
4         A       C       a
..      ...     ...     ...
195     NaN     NaN       c
196     NaN     NaN       d
197     NaN     NaN       b
198     NaN     NaN       b
199     NaN     NaN       a

[200 rows x 3 columns]

### Create DataFrame from CSV

In [10]:
csv = '../csvs/nc-est2019-agesex-res.csv'
pops = pd.read_csv(csv, usecols=[0, 1, 10, 11])
pops

     SEX  AGE  POPESTIMATE2018  POPESTIMATE2019
0      0    0          3815343          3783052
1      0    1          3908830          3829599
2      0    2          3987032          3922044
3      0    3          4033038          3998665
4      0    4          4018719          4043323
..   ...  ...              ...              ...
298    2   96           108573           111417
299    2   97            82100            84358
300    2   98            57593            62607
301    2   99            39576            42528
302    2  100            72153            76850

[303 rows x 4 columns]

### Column Names and Row index

In [11]:
pops.index

RangeIndex(start=0, stop=303, step=1)

In [12]:
pops.columns

Index(['SEX', 'AGE', 'POPESTIMATE2018', 'POPESTIMATE2019'], dtype='object')

### Number of Columns and Rows

In [13]:
num_rows = len(pops)
num_cols = len(pops.columns)
num_rows, num_cols

(303, 4)

### Shape

In [14]:
pops.shape

(303, 4)

### head() and tail()

In [15]:
pops.head()

   SEX  AGE  POPESTIMATE2018  POPESTIMATE2019
0    0    0          3815343          3783052
1    0    1          3908830          3829599
2    0    2          3987032          3922044
3    0    3          4033038          3998665
4    0    4          4018719          4043323

In [16]:
pops.tail()

     SEX  AGE  POPESTIMATE2018  POPESTIMATE2019
298    2   96           108573           111417
299    2   97            82100            84358
300    2   98            57593            62607
301    2   99            39576            42528
302    2  100            72153            76850

In [17]:
pops.describe()

              SEX         AGE  POPESTIMATE2018  POPESTIMATE2019
count  303.000000  303.000000     3.030000e+02     3.030000e+02
mean     1.000000   50.000000     2.156353e+06     2.166598e+06
std      0.817847   29.202989     1.311979e+06     1.308517e+06
min      0.000000    0.000000     1.360800e+04     1.459600e+04
25%      0.000000   25.000000     1.273158e+06     1.408510e+06
50%      1.000000   50.000000     2.073767e+06     2.071538e+06
75%      2.000000   75.000000     2.373338e+06     2.394120e+06
max      2.000000  100.000000     4.803933e+06     4.818725e+06

### Accessing Columns

In [18]:
pops['POPESTIMATE2019']

0      3783052
1      3829599
2      3922044
3      3998665
4      4043323
        ...
298     111417
299      84358
300      62607
301      42528
302      76850
Name: POPESTIMATE2019, Length: 303, dtype: int64

In [19]:
pops.POPESTIMATE2019

0      3783052
1      3829599
2      3922044
3      3998665
4      4043323
        ...
298     111417
299      84358
300      62607
301      42528
302      76850
Name: POPESTIMATE2019, Length: 303, dtype: int64

In [20]:
pops[['AGE', 'SEX', 'POPESTIMATE2019']]

     AGE  SEX  POPESTIMATE2019
0      0    0          3783052
1      1    0          3829599
2      2    0          3922044
3      3    0          3998665
4      4    0          4043323
..   ...  ...              ...
298   96    2           111417
299   97    2            84358
300   98    2            62607
301   99    2            42528
302  100    2            76850

[303 rows x 3 columns]

In [21]:
cols = ['AGE', 'SEX', 'POPESTIMATE2019']
pops[cols]

     AGE  SEX  POPESTIMATE2019
0      0    0          3783052
1      1    0          3829599
2      2    0          3922044
3      3    0          3998665
4      4    0          4043323
..   ...  ...              ...
298   96    2           111417
299   97    2            84358
300   98    2            62607
301   99    2            42528
302  100    2            76850

[303 rows x 3 columns]

### Changing Values in a Column

In [22]:
pops.SEX.unique() # Current values of pops.SEX

array([0, 1, 2], dtype=int64)

In [23]:
def fix_sex_values(sex):
    if sex == 0:
        return 'T'
    elif sex == 1:
        return 'M'
    else: # 2
        return 'F'
    
pops.SEX = pops.SEX.apply(fix_sex_values)

In [24]:
pops.SEX.unique() # New values of pops.SEX

array(['T', 'M', 'F'], dtype=object)

### Setting the index when creating the `DataFrame`

In [25]:
csv ='../csvs/mantle.csv'
mantle = pd.read_csv(csv, usecols=range(7), index_col='Year')
mantle.head()

       Tm    G   PA   AB    R    H
Year
1951  NYY   96  386  341   61   91
1952  NYY  142  626  549   94  171
1953  NYY  127  540  461  105  136
1954  NYY  146  649  543  129  163
1955  NYY  147  638  517  121  158

### Changing the index of an Existing `DataFrame`

In [26]:
pops['SEX_AGE'] = pops['SEX'] + pops['AGE'].apply(str)
pops.set_index('SEX_AGE', inplace=True)
pops

        SEX  AGE  POPESTIMATE2018  POPESTIMATE2019
SEX_AGE
T0        T    0          3815343          3783052
T1        T    1          3908830          3829599
T2        T    2          3987032          3922044
T3        T    3          4033038          3998665
T4        T    4          4018719          4043323
...      ..  ...              ...              ...
F96       F   96           108573           111417
F97       F   97            82100            84358
F98       F   98            57593            62607
F99       F   99            39576            42528
F100      F  100            72153            76850

[303 rows x 4 columns]

### Accessing Rows

In [27]:
pops.loc['T25']

SEX                      T
AGE                     25
POPESTIMATE2018    4593783
POPESTIMATE2019    4539058
Name: T25, dtype: object

In [28]:
pops.loc[['F25', 'M25', 'T25']]

        SEX  AGE  POPESTIMATE2018  POPESTIMATE2019
SEX_AGE
F25       F   25          2234325          2213205
M25       M   25          2359458          2325853
T25       T   25          4593783          4539058

In [60]:
pops.loc['T20':'T25']

        SEX  AGE  POPESTIMATE2018  POPESTIMATE2019
SEX_AGE
T20       T   20          4262078          4269683
T21       T   21          4279527          4278323
T22       T   22          4321222          4298772
T23       T   23          4424783          4341644
T24       T   24          4520476          4444518
T25       T   25          4593783          4539058

In [30]:
pops.iloc[4]

SEX                      T
AGE                      4
POPESTIMATE2018    4018719
POPESTIMATE2019    4043323
Name: T4, dtype: object

In [31]:
pops.iloc[[0, 1, 2, -3, -2, -1]]

        SEX  AGE  POPESTIMATE2018  POPESTIMATE2019
SEX_AGE
T0        T    0          3815343          3783052
T1        T    1          3908830          3829599
T2        T    2          3987032          3922044
F98       F   98            57593            62607
F99       F   99            39576            42528
F100      F  100            72153            76850

In [32]:
pops.iloc[:5]

        SEX  AGE  POPESTIMATE2018  POPESTIMATE2019
SEX_AGE
T0        T    0          3815343          3783052
T1        T    1          3908830          3829599
T2        T    2          3987032          3922044
T3        T    3          4033038          3998665
T4        T    4          4018719          4043323

### Combining Row and Column Selection

In [33]:
first5rows = pops.iloc[:5]
type(first5rows)

pandas.core.frame.DataFrame

#### Two Steps - Rows First

In [34]:
first5rows = pops.iloc[:5]
first5rows[['POPESTIMATE2018']]

         POPESTIMATE2018
SEX_AGE
T0               3815343
T1               3908830
T2               3987032
T3               4033038
T4               4018719

#### Two Steps - Columns First

In [35]:
pop2018 = pops[['POPESTIMATE2018']]
pop2018.iloc[:5]

         POPESTIMATE2018
SEX_AGE
T0               3815343
T1               3908830
T2               3987032
T3               4033038
T4               4018719

#### One Step - Rows First

In [36]:
pops.iloc[:5][['POPESTIMATE2018']]

         POPESTIMATE2018
SEX_AGE
T0               3815343
T1               3908830
T2               3987032
T3               4033038
T4               4018719

#### One Step - Columns First

In [37]:
pops[['POPESTIMATE2018']].iloc[:5]

         POPESTIMATE2018
SEX_AGE
T0               3815343
T1               3908830
T2               3987032
T3               4033038
T4               4018719

#### Getting a Series (Rows then Column)

In [61]:
pops.iloc[:5]['POPESTIMATE2018']

SEX_AGE
T0    3815343
T1    3908830
T2    3987032
T3    4033038
T4    4018719
Name: POPESTIMATE2018, dtype: int64

In [39]:
pops.iloc[:5].POPESTIMATE2018

SEX_AGE
T0    3815343
T1    3908830
T2    3987032
T3    4033038
T4    4018719
Name: POPESTIMATE2018, dtype: int64

#### Getting a Series (Column then Rows)

In [40]:
pops['POPESTIMATE2018'].iloc[:5]

SEX_AGE
T0    3815343
T1    3908830
T2    3987032
T3    4033038
T4    4018719
Name: POPESTIMATE2018, dtype: int64

In [41]:
pops.POPESTIMATE2018.iloc[:5]

SEX_AGE
T0    3815343
T1    3908830
T2    3987032
T3    4033038
T4    4018719
Name: POPESTIMATE2018, dtype: int64

### Math on a DataFrame vs. a Series

In [42]:
pops.iloc[:5][['POPESTIMATE2018']].mean()

POPESTIMATE2018    3952592.4
dtype: float64

In [43]:
pops.iloc[:5]['POPESTIMATE2018'].mean()

3952592.4

In [44]:
pops.iloc[:5][['POPESTIMATE2018', 'POPESTIMATE2019']].mean()

POPESTIMATE2018    3952592.4
POPESTIMATE2019    3915336.6
dtype: float64

### Getting Specific Data

In [45]:
pops.at['F40', 'POPESTIMATE2019']

2058650

In [46]:
pops.iat[41, 3]

4020254

### Boolean Selection

In [47]:
pops[pops.SEX == 'F']

        SEX  AGE  POPESTIMATE2018  POPESTIMATE2019
SEX_AGE
F0        F    0          1863680          1847935
F1        F    1          1909808          1871014
F2        F    2          1949783          1916500
F3        F    3          1971149          1955655
F4        F    4          1962288          1976372
...      ..  ...              ...              ...
F96       F   96           108573           111417
F97       F   97            82100            84358
F98       F   98            57593            62607
F99       F   99            39576            42528
F100      F  100            72153            76850

[101 rows x 4 columns]

In [48]:
pops[(pops.SEX == 'M') | (pops.SEX == 'F')]

        SEX  AGE  POPESTIMATE2018  POPESTIMATE2019
SEX_AGE
M0        M    0          1951663          1935117
M1        M    1          1999022          1958585
M2        M    2          2037249          2005544
M3        M    3          2061889          2043010
M4        M    4          2056431          2066951
...      ..  ...              ...              ...
F96       F   96           108573           111417
F97       F   97            82100            84358
F98       F   98            57593            62607
F99       F   99            39576            42528
F100      F  100            72153            76850

[202 rows x 4 columns]

In [49]:
pops[(pops.SEX == 'F') & (pops.AGE > 65)]

        SEX  AGE  POPESTIMATE2018  POPESTIMATE2019
SEX_AGE
F66       F   66          1855724          1914181
F67       F   67          1801724          1836574
F68       F   68          1754148          1781346
F69       F   69          1697549          1731958
F70       F   70          1672708          1674584
...      ..  ...              ...              ...
F96       F   96           108573           111417
F97       F   97            82100            84358
F98       F   98            57593            62607
F99       F   99            39576            42528
F100      F  100            72153            76850

[35 rows x 4 columns]

### Filtering a DataFrame with a Boolean Series

In [50]:
(pops.POPESTIMATE2018 > pops.POPESTIMATE2019) & (pops.SEX == 'T')

SEX_AGE
T0       True
T1       True
T2       True
T3       True
T4      False
        ...
F96     False
F97     False
F98     False
F99     False
F100    False
Length: 303, dtype: bool

In [51]:
pops[(pops.POPESTIMATE2018 > pops.POPESTIMATE2019) & (pops.SEX == 'T')]

        SEX  AGE  POPESTIMATE2018  POPESTIMATE2019
SEX_AGE
T0        T    0          3815343          3783052
T1        T    1          3908830          3829599
T2        T    2          3987032          3922044
T3        T    3          4033038          3998665
T7        T    7          4058370          4022319
...      ..  ...              ...              ...
T75       T   75          2288885          2198286
T85       T   85           932507           922467
T87       T   87           781145           778923
T88       T   88           714808           703078
T90       T   90           539372           536447

[43 rows x 4 columns]

### Pivoting a DataFrame

In [52]:
pops2 = pops.pivot(index='AGE', columns = 'SEX', values='POPESTIMATE2019')
pops2

SEX        F        M        T
AGE
0    1847935  1935117  3783052
1    1871014  1958585  3829599
2    1916500  2005544  3922044
3    1955655  2043010  3998665
4    1976372  2066951  4043323
..       ...      ...      ...
96    111417    46046   157463
97     84358    32611   116969
98     62607    23543    86150
99     42528    14596    57124
100    76850    23472   100322

[101 rows x 3 columns]

#### For which ages were there more females than males in 2019?

In [53]:
pops2['DIFF'] = pops2.F - pops2.M
pops2[pops2.F > pops2.M]

SEX        F        M        T   DIFF
AGE
38   2156217  2149359  4305576   6858
40   2058650  2046663  4105313  11987
41   2018752  2001502  4020254  17250
42   2002157  1972584  3974741  29573
43   1940751  1913289  3854040  27462
..       ...      ...      ...    ...
96    111417    46046   157463  65371
97     84358    32611   116969  51747
98     62607    23543    86150  39064
99     42528    14596    57124  27932
100    76850    23472   100322  53378

[62 rows x 4 columns]

In [75]:
(pops2['F'] / pops2['M']).iloc[range(0, 101, 10)]

AGE
0      0.954947
10     0.960123
20     0.955754
30     0.971230
40     1.005857
         ...
60     1.071764
70     1.145312
80     1.292093
90     1.805392
100    3.274114
Length: 11, dtype: float64

In [79]:
(pops2['F'] / pops2['M']).iloc[-10:]

AGE
91     1.902753
92     1.992520
93     2.101919
94     2.227101
95     2.340420
96     2.419689
97     2.586796
98     2.659262
99     2.913675
100    3.274114
dtype: float64

### Common Gotcha

In [54]:
type(pops2['F']), type(pops2['M']), type(pops2['T'])

(pandas.core.series.Series,
 pandas.core.series.Series,
 pandas.core.series.Series)

In [55]:
type(pops2.F), type(pops2.M), type(pops2.T)

(pandas.core.series.Series,
 pandas.core.series.Series,
 pandas.core.frame.DataFrame)

In [80]:
pd.set_option('display.max_columns', 6)
pd.set_option('display.max_rows', 6)
pops2['T']

AGE
0      3783052
1      3829599
2      3922044
        ...
98       86150
99       57124
100     100322
Name: T, Length: 101, dtype: int64

In [81]:
pops2.T

AGE       0        1        2    ...    98     99      100
SEX                              ...
F     1847935  1871014  1916500  ...  62607  42528   76850
M     1935117  1958585  2005544  ...  23543  14596   23472
T     3783052  3829599  3922044  ...  86150  57124  100322
DIFF   -87182   -87571   -89044  ...  39064  27932   53378

[4 rows x 101 columns]

In [58]:
? pops2.T

Type:        property
String form: <property object at 0x134E26E0>
Docstring:
Transpose index and columns.

Reflect the DataFrame over its main diagonal by writing rows as columns
and vice-versa. The property :attr:`.T` is an accessor to the method
:meth:`transpose`.

Parameters
----------
*args : tuple, optional
    Accepted for compatibility with NumPy.
copy : bool, default False
    Whether to copy the data after transposing, even for DataFrames
    with a single dtype.

    Note that a copy is always required for mixed dtype DataFrames,
    or for DataFrames with any extension types.

Returns
-------
DataFrame
    The transposed DataFrame.

See Also
--------
numpy.transpose : Permute the dimensions of a given array.

Notes
-----
Transposing a DataFrame with mixed dtypes will result in a homogeneous
DataFrame with the `object` dtype. In such a case, a copy of the data
is always made.

Examples
--------
**Square DataFrame with homogeneous dtype**

>>> d1 = {'col1': [1, 2], 'col2': [3, 4]}
>>> df1 = pd.DataFrame(data=d1)
>>> df1
   col1  col2
0     1     3
1     2     4

>>> df1_transposed = df1.T # or df1.transpose()
>>> df1_transposed
      0  1
col1  1  2
col2  3  4

When the dtype is homogeneous in the original DataFrame, we get a
transposed DataFrame with the same dtype:

>>> df1.dtypes
col1    int64
col2    int64
dtype: object
>>> df1_transposed.dtypes
0    int64
1    int64
dtype: object

**Non-square DataFrame with mixed dtypes**

>>> d2 = {'name': ['Alice', 'Bob'],
...       'score': [9.5, 8],
...       'employed': [False, True],
...       'kids': [0, 0]}
>>> df2 = pd.DataFrame(data=d2)
>>> df2
    name  score  employed  kids
0  Alice    9.5     False     0
1    Bob    8.0      True     0

>>> df2_transposed = df2.T # or df2.transpose()
>>> df2_transposed
              0     1
name      Alice   Bob
score       9.5     8
employed  False  True
kids          0     0

When the DataFrame has mixed dtypes, we get a transposed DataFrame with
the `object` dtype:

>>> df2.dtypes
name         object
score       float64
employed       bool
kids          int64
dtype: object
>>> df2_transposed.dtypes
0    object
1    object
dtype: object

---
CSV Source: National Population by Characteristics: 2010-2019

https://www.census.gov/data/datasets/time-series/demo/popest/2010s-national-detail.html